// 메인 공지사항 샘플데이터
export const NOTICE_DATA = [
  {
    id: 'notice-01',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내1',
    content: `공지사항 내용을 표시합니다1`,
    isNew: true, //New 플래그 표시
  },
  {
    id: 'notice-02',
    field: '정책',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내2',
    content: `공지사항 내용을 표시합니다2`,
  },
  {
    id: 'notice-03',
    field: '도움말',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내3',
    content: `공지사항 내용을 표시합니다3`,
  },
  {
    id: 'notice-04',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내4',
    content: `공지사항 내용을 표시합니다4`,
  },
  {
    id: 'notice-05',
    field: '도움말',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내5',
    content: `공지사항 내용을 표시합니다5`,
  },
  {
    id: 'notice-06',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내6',
    content: `공지사항 내용을 표시합니다6`,
  },
  {
    id: 'notice-07',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내7',
    content: `공지사항 내용을 표시합니다7`,
  },
  {
    id: 'notice-08',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내8',
    content: `공지사항 내용을 표시합니다8`,
  },
  {
    id: 'notice-09',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내9',
    content: `공지사항 내용을 표시합니다9`,
  },
  {
    id: 'notice-10',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내10',
    content: `공지사항 내용을 표시합니다10`,
  },
  {
    id: 'notice-11',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내11',
    content: `공지사항 내용을 표시합니다11`,
  },
  {
    id: 'notice-12',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내12',
    content: `공지사항 내용을 표시합니다12`,
  },
  {
    id: 'notice-13',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내13',
    content: `공지사항 내용을 표시합니다13`,
  },
  {
    id: 'notice-14',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내14',
    content: `공지사항 내용을 표시합니다14`,
  },
  {
    id: 'notice-15',
    field: '공지',
    date: '2026-07-25 08:10',
    title: '개인정보처리방침 변경 안내15',
    content: `공지사항 내용을 표시합니다15`,
  },
]

// 메인 QNA 샘플데이터
export const QNA_DATA = [
  {
    id: 'qna-01',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.1',
    content: `공지사항 내용을 표시합니다1`,
    status: 'complete', //답변완료
    answers: [
      {
        id: 'answer-01',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-02',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.2',
    content: `공지사항 내용을 표시합니다2`,
    status: 'pending', //답변대기
    answers: [
      {
        id: 'answer-02',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-03',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.3',
    content: `공지사항 내용을 표시합니다3`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-03',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-04',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.4',
    content: `공지사항 내용을 표시합니다4`,
    status: 'complete', //진행중
    answers: [
      {
        id: 'answer-04',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-05',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.5',
    content: `공지사항 내용을 표시합니다5`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-05',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-06',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.6',
    content: `공지사항 내용을 표시합니다6`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-06',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-07',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.7',
    content: `공지사항 내용을 표시합니다7`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-07',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-08',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.8',
    content: `공지사항 내용을 표시합니다8`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-08',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-09',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.9',
    content: `공지사항 내용을 표시합니다9`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-09',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-10',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.10',
    content: `공지사항 내용을 표시합니다10`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-10',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-11',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.11',
    content: `공지사항 내용을 표시합니다11`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-11',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-12',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.12',
    content: `공지사항 내용을 표시합니다12`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-12',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-13',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.13',
    content: `공지사항 내용을 표시합니다13`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-13',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-14',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.14',
    content: `공지사항 내용을 표시합니다14`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-14',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
  {
    id: 'qna-15',
    field: '공지',
    date: '2026-07-25 08:10',
    title: 'QNA 타이틀 입니다.15',
    content: `공지사항 내용을 표시합니다15`,
    status: 'progress', //진행중
    answers: [
      {
        id: 'answer-15',
        content:
          '최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다. 최근 발생한 개인정보 유출 피해와 관련하여, 원하시는 kt M모바일 고객님들께 무료로 교체를 지원하기로 하였습니다. 고객님의 불편함이 없도록 교체 시작일자와 다양한 교체 방법을 아래와 같이 알려드립니다.',
      },
    ],
  },
]
